{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\akadi\Documents\PhD\Data\Aid_Rad\appendix.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Dec 2022, 12:49:32
{txt}
{com}. 
. /*** -------------------------------------------------------------------------------
> *** TABLE OF CONTENTS ***
> ------------------------------------------------------------------------------- ***/
. * Figure A1. Support shares of factions, 1994-2014.
. * Figure A2. Trends in time devoted to praying, 2004-2014.
. * Figure A3. Praying trends by district.
. * Table A1. Descriptive statistics, PCPSR.
. * Table A2. Descriptive statistics, district-level variables.
. 
. *****Figure A1
. 
. use "Palestinian Public Opinion\Pcpsr\Palestinian Public Opinion dataset\pcbsr_microdata_13.dta", clear
{txt}
{com}. 
. keep year quarter faction_support
{txt}
{com}. 
. tabulate faction_support, generate(faction)

             {txt}Choice for political party {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                                   DFLP {c |}{res}      1,158        0.88        0.88
{txt}                                  Fateh {c |}{res}     50,087       38.04       38.92
{txt}                             h.al-sha'b {c |}{res}        440        0.33       39.26
{txt}                                  Hamas {c |}{res}     20,843       15.83       55.09
{txt}                                   PFLP {c |}{res}      4,944        3.76       58.84
{txt}                                   Fida {c |}{res}        559        0.42       59.27
{txt}                  Independent Islamists {c |}{res}      4,373        3.32       62.59
{txt}               Independent Nationalists {c |}{res}      6,142        4.67       67.25
{txt}                            Independent {c |}{res}        466        0.35       67.61
{txt}                          Islamic Jihad {c |}{res}      3,566        2.71       70.32
{txt}                                 Others {c |}{res}      3,200        2.43       72.75
{txt}                                 No one {c |}{res}     34,458       26.17       98.92
{txt}                                    PPP {c |}{res}        905        0.69       99.61
{txt}                    Independent leftist {c |}{res}         11        0.01       99.62
{txt}national inititiative (almubadara al wa {c |}{res}        383        0.29       99.91
{txt}       third way headed by salam feyyad {c |}{res}        123        0.09      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}    131,658      100.00
{txt}
{com}. 
. rename faction1 DFLP
{res}{txt}
{com}. rename faction2 Fatah
{res}{txt}
{com}. rename faction3 h_al_shab
{res}{txt}
{com}. rename faction4 Hamas
{res}{txt}
{com}. rename faction5 PFLP
{res}{txt}
{com}. rename faction6 Fida
{res}{txt}
{com}. rename faction7 Ind_Islamists
{res}{txt}
{com}. rename faction8 Ind_Nationalists
{res}{txt}
{com}. rename faction9 Independent
{res}{txt}
{com}. rename faction10 Islamic_Jihad
{res}{txt}
{com}. rename faction11 Others
{res}{txt}
{com}. rename faction12 No_one
{res}{txt}
{com}. rename faction13 PPP
{res}{txt}
{com}. rename faction14 Ind_leftist
{res}{txt}
{com}. rename faction15 national_inititiative
{res}{txt}
{com}. rename faction16 third_way
{res}{txt}
{com}. 
. drop if year == 1993
{txt}(4251 observations deleted)

{com}. 
. replace Islamic_Jihad = 1 if faction_support == 7 | faction_support == 10
{txt}(4373 real changes made)

{com}. generate other_fac = 0
{txt}
{com}. replace other_fac = 1 if faction_support == 1 | faction_support == 3 | faction_support == 5  | faction_support == 6  | faction_support == 8 | faction_support == 9 | faction_support == 11  | faction_support == 13  | faction_support == 14 | faction_support == 15  | faction_support == 16
{txt}(16637 real changes made)

{com}. 
. 
. generate year_quarter = yq(year,quarter)
{txt}
{com}. sort year_quarter
{txt}
{com}. 
. collapse Fatah Hamas Islamic_Jihad other_fac No_one, by(year_quarter)
{txt}
{com}. 
. tsset year_quarter, quarterly
{res}{txt}{col 9}time variable:  {res}{col 25}year_quarter, 1994q1 to 2014q4, but with gaps
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. 
. label variable Fatah "Fatah"
{txt}
{com}. label variable Hamas "Hamas"
{txt}
{com}. label variable Islamic_Jihad "PIJ and Islamic Independents"
{txt}
{com}. label variable other_fac "Other factions"
{txt}
{com}. label variable No_one "No one"
{txt}
{com}. label variable year_quarter "Quarter"
{txt}
{com}. 
. twoway (line Fatah year_quarter, yaxis(1) yscale(range(0) axis(1))) (line Hamas year_quarter, yaxis(1) yscale(range(0) axis(1)))(line Islamic_Jihad year_quarter, yaxis(1) yscale(range(0) axis(1))) (line other_fac year_quarter, yaxis(1) yscale(range(0) axis(1))) (line No_one year_quarter, yaxis(1) yscale(range(0) axis(1))), ytitle(Share of support)
{res}{txt}
{com}. 
. *****Figure A2
. 
. use "Aid_Rad\faction_support.dta", clear
{txt}
{com}. 
. *remove respondants below the age of 18
. drop if age_group == 0
{txt}(30 observations deleted)

{com}. 
. *remove respondents with unknown education level
. drop if educ_level == 8
{txt}(107 observations deleted)

{com}. 
. *reomove respondents with missing data
. 
. drop if faction_support == .
{txt}(124 observations deleted)

{com}. drop if age_group == .
{txt}(162 observations deleted)

{com}. drop if locality_type == .
{txt}(1205 observations deleted)

{com}. drop if educ_level == .
{txt}(0 observations deleted)

{com}. drop if sector == .
{txt}(0 observations deleted)

{com}. drop if occupation == .
{txt}(278 observations deleted)

{com}. drop if sex == .
{txt}(78 observations deleted)

{com}. drop if refugee_status == .
{txt}(65 observations deleted)

{com}. drop if marital_status == .
{txt}(0 observations deleted)

{com}. drop if praying == .
{txt}(694 observations deleted)

{com}. 
. *religous variables
. generate pray =(praying == 1) if praying ~= .
{txt}
{com}. drop praying
{txt}
{com}. rename pray praying
{res}{txt}
{com}. 
. graph bar (mean) praying, over(year) ytitle(Share of people praying five times a day)
{res}{txt}
{com}. 
. *****Figure A3
. 
. use "Aid_Rad\faction_support.dta", clear
{txt}
{com}. 
. *remove respondants below the age of 18
. drop if age_group == 0
{txt}(30 observations deleted)

{com}. 
. *remove respondents with unknown education level
. drop if educ_level == 8
{txt}(107 observations deleted)

{com}. 
. *reomove respondents with missing data
. 
. drop if faction_support == .
{txt}(124 observations deleted)

{com}. drop if age_group == .
{txt}(162 observations deleted)

{com}. drop if locality_type == .
{txt}(1205 observations deleted)

{com}. drop if educ_level == .
{txt}(0 observations deleted)

{com}. drop if sector == .
{txt}(0 observations deleted)

{com}. drop if occupation == .
{txt}(278 observations deleted)

{com}. drop if sex == .
{txt}(78 observations deleted)

{com}. drop if refugee_status == .
{txt}(65 observations deleted)

{com}. drop if marital_status == .
{txt}(0 observations deleted)

{com}. drop if praying == .
{txt}(694 observations deleted)

{com}. 
. *religous variables
. generate pray =(praying == 1) if praying ~= .
{txt}
{com}. drop praying
{txt}
{com}. rename pray praying
{res}{txt}
{com}. 
. collapse praying,by (year district)
{txt}
{com}. 
. label variable praying "Praying five times a day"
{txt}
{com}. 
. xtset district year, yearly
{res}{txt}{col 8}panel variable:  {res}district (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2004 to 2014
{txt}{col 17}delta:  {res}1 year
{txt}
{com}. xtline praying, recast(line) ytitle(Share of people praying five times a day) ttitle(Year)
{res}{txt}
{com}. 
. 
. *****Table A1
. 
. *macro for Table A1
. global demographic praying female married refugees gaza ibn.occupation ibn.sector ibn.locality_type ibn.age_group ibn.educ_level f_inc_less_600
{txt}
{com}. 
. *left columns
. use "Aid_Rad\2004-2007.dta", clear
{txt}
{com}. sum  Fatah Hamas Islamic_Jihad other_fac No_one $demographic

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}Fatah {c |}{res}     20064    .3630383    .4808877          0          1
{txt}{space 7}Hamas {c |}{res}     20064    .2533892    .4349627          0          1
{txt}Islamic_Ji~d {c |}{res}     20064    .0658892    .2480944          0          1
{txt}{space 3}other_fac {c |}{res}     20064    .0913577    .2881242          0          1
{txt}{space 6}No_one {c |}{res}     20064    .2263258    .4184628          0          1
{txt}{hline 13}{c +}{hline 56}
{space 5}praying {c |}{res}     20064    .8555622    .3515419          0          1
{txt}{space 6}female {c |}{res}     20064    .5052831    .4999845          0          1
{txt}{space 5}married {c |}{res}     20064    .7541866    .4305792          0          1
{txt}{space 4}refugees {c |}{res}     20064     .449063    .4974111          0          1
{txt}{space 8}gaza {c |}{res}     20064    .3649322    .4814231          0          1
{txt}{hline 13}{c +}{hline 56}
{space 12} {c |}
{space 2}occupation {c |}
{space 4}Student  {c |}{res}     20064     .092803    .2901634          0          1
{txt}Waged lab..  {c |}{res}     20064    .0857257    .2799655          0          1
{txt}{space 1}Housewives  {c |}{res}     20064    .4009171    .4900965          0          1
{txt}Employee/~l  {c |}{res}     20064    .1493222    .3564146          0          1
{txt}{space 2}Merchants  {c |}{res}     20064    .0585626    .2348101          0          1
{txt}{hline 13}{c +}{hline 56}
{space 4}Farmers  {c |}{res}     20064    .0157994     .124702          0          1
{txt}{space 2}Craftsmen  {c |}{res}     20064    .0645435    .2457247          0          1
{txt}High Prof..  {c |}{res}     20064    .0049342    .0700722          0          1
{txt}{space 1}Unemployed  {c |}{res}     20064    .1113437    .3145651          0          1
{txt}{space 4}Retired  {c |}{res}     20064    .0160486    .1256657          0          1
{txt}{hline 13}{c +}{hline 56}
{space 12} {c |}
{space 6}sector {c |}
{space 5}public  {c |}{res}     20064    .1226077    .3279945          0          1
{txt}{space 4}private  {c |}{res}     20064    .2482556    .4320116          0          1
{txt}other/no_~k  {c |}{res}     20064    .6291368     .483048          0          1
{txt}{space 12} {c |}
locality_t~e {c |}
{space 7}city  {c |}{res}     20064    .3913975    .4880752          0          1
{txt}village/t~n  {c |}{res}     20064    .4302731    .4951266          0          1
{txt}{hline 13}{c +}{hline 56}
refugee c..  {c |}{res}     20064    .1783293    .3827993          0          1
{txt}{space 12} {c |}
{space 3}age_group {c |}
{space 6}18-24  {c |}{res}     20064    .2133174    .4096602          0          1
{txt}{space 6}25-31  {c |}{res}     20064    .2098285    .4071963          0          1
{txt}{space 6}32-38  {c |}{res}     20064    .1866029    .3896021          0          1
{txt}{space 6}39-45  {c |}{res}     20064    .1629785    .3693552          0          1
{txt}{hline 13}{c +}{hline 56}
{space 6}46-52  {c |}{res}     20064    .0977871    .2970339          0          1
{txt}{space 8}53+  {c |}{res}     20064    .1294856     .335745          0          1
{txt}{space 12} {c |}
{space 2}educ_level {c |}
{space 1}Illiterate  {c |}{res}     20064    .0677333    .2512939          0          1
{txt}{space 1}Elementary  {c |}{res}     20064    .1388557    .3458045          0          1
{txt}Preperatory  {c |}{res}     20064    .2508473    .4335116          0          1
{txt}{hline 13}{c +}{hline 56}
{space 2}Secondary  {c |}{res}     20064    .3288477    .4698062          0          1
{txt}{space 4}College  {c |}{res}     20064    .0857755    .2800393          0          1
{txt}{space 9}BA  {c |}{res}     20064    .1172249    .3216961          0          1
{txt}{space 2}MA & over  {c |}{res}     20064    .0107157    .1029632          0          1
{txt}{space 12} {c |}
f_inc_le~600 {c |}{res}     16134    .2280278    .4195736          0          1
{txt}
{com}. 
. *right columns
. use "Aid_Rad\2009-2014.dta", clear
{txt}
{com}. sum  Fatah Hamas Islamic_Jihad other_fac No_one $demographic

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}Fatah {c |}{res}     28176    .3635718    .4810359          0          1
{txt}{space 7}Hamas {c |}{res}     28176    .1676959    .3736027          0          1
{txt}Islamic_Ji~d {c |}{res}     28176    .0436187    .2042488          0          1
{txt}{space 3}other_fac {c |}{res}     28176    .0971749     .296201          0          1
{txt}{space 6}No_one {c |}{res}     28176    .3279387    .4694707          0          1
{txt}{hline 13}{c +}{hline 56}
{space 5}praying {c |}{res}     28176    .8295358    .3760468          0          1
{txt}{space 6}female {c |}{res}     28176    .5086244    .4999345          0          1
{txt}{space 5}married {c |}{res}     28176    .7452797    .4357116          0          1
{txt}{space 4}refugees {c |}{res}     28176    .4527967    .4977757          0          1
{txt}{space 8}gaza {c |}{res}     28176    .3518952      .47757          0          1
{txt}{hline 13}{c +}{hline 56}
{space 12} {c |}
{space 2}occupation {c |}
{space 4}Student  {c |}{res}     28176    .0946905    .2927922          0          1
{txt}Waged lab..  {c |}{res}     28176    .1014338    .3019077          0          1
{txt}{space 1}Housewives  {c |}{res}     28176    .3732254    .4836698          0          1
{txt}Employee/~l  {c |}{res}     28176    .1769591    .3816409          0          1
{txt}{space 2}Merchants  {c |}{res}     28176    .0507879    .2195682          0          1
{txt}{hline 13}{c +}{hline 56}
{space 4}Farmers  {c |}{res}     28176    .0165034    .1274034          0          1
{txt}{space 2}Craftsmen  {c |}{res}     28176    .0648069    .2461892          0          1
{txt}{space 1}Unemployed  {c |}{res}     28176    .1023566    .3031221          0          1
{txt}{space 4}Retired  {c |}{res}     28176    .0192362    .1373567          0          1
{txt}{space 12} {c |}
{space 6}sector {c |}
{space 5}public  {c |}{res}     28176    .1318498    .3383334          0          1
{txt}{hline 13}{c +}{hline 56}
{space 4}private  {c |}{res}     28176     .280345    .4491757          0          1
{txt}other/no_~k  {c |}{res}     28176    .5878052    .4922386          0          1
{txt}{space 12} {c |}
locality_t~e {c |}
{space 7}city  {c |}{res}     28176    .6587166    .4741487          0          1
{txt}village/t~n  {c |}{res}     28176    .2192291    .4137315          0          1
{txt}refugee c..  {c |}{res}     28176    .1220542    .3273542          0          1
{txt}{hline 13}{c +}{hline 56}
{space 12} {c |}
{space 3}age_group {c |}
{space 6}18-24  {c |}{res}     28176    .1991056    .3993347          0          1
{txt}{space 6}25-31  {c |}{res}     28176    .2006317    .4004801          0          1
{txt}{space 6}32-38  {c |}{res}     28176    .1811471    .3851468          0          1
{txt}{space 6}39-45  {c |}{res}     28176    .1583972    .3651195          0          1
{txt}{space 6}46-52  {c |}{res}     28176     .113075      .31669          0          1
{txt}{hline 13}{c +}{hline 56}
{space 8}53+  {c |}{res}     28176    .1476434    .3547524          0          1
{txt}{space 12} {c |}
{space 2}educ_level {c |}
{space 1}Illiterate  {c |}{res}     28176    .0413827    .1991773          0          1
{txt}{space 1}Elementary  {c |}{res}     28176    .1141752    .3180296          0          1
{txt}Preperatory  {c |}{res}     28176    .2208617    .4148348          0          1
{txt}{space 2}Secondary  {c |}{res}     28176    .3242121     .468088          0          1
{txt}{hline 13}{c +}{hline 56}
{space 4}College  {c |}{res}     28176     .100937    .3012506          0          1
{txt}{space 9}BA  {c |}{res}     28176     .185548    .3887484          0          1
{txt}{space 2}MA & over  {c |}{res}     28176    .0128833    .1127731          0          1
{txt}{space 12} {c |}
f_inc_le~600 {c |}{res}     28155    .1070858    .3092278          0          1
{txt}
{com}. 
. *****Table A2
. 
. *macros for Table A2
. global binary received_pna received_charity received_international received_other
{txt}
{com}. global values pna charity international other
{txt}
{com}. global soc_ec r_dwage unemployment
{txt}
{com}. 
. 
. *left columns
. use "Aid_Rad\2004-2007.dta", clear
{txt}
{com}. collapse $binary $values pal_fatalities $faction_fat $soc_ec ,by(district_year)
{txt}
{com}. sum $binary $values pal_fatalities $faction_fat $soc_ec

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
received_pna {c |}{res}        64    .1543267    .1808644          0   .6321339
{txt}received_c~y {c |}{res}        64    .0555545    .0484521          0   .1839145
{txt}received_i~l {c |}{res}        64    .1284421     .123827          0   .4784616
{txt}received_o~r {c |}{res}        64    .1679259    .1577668          0   .5248611
{txt}{space 9}pna {c |}{res}        64    71.73634    77.15816          0   448.5288
{txt}{hline 13}{c +}{hline 56}
{space 5}charity {c |}{res}        64    16.93968    19.97866          0   126.4607
{txt}internatio~l {c |}{res}        64    50.61208    53.64503          0   208.2965
{txt}{space 7}other {c |}{res}        64    104.4166    236.3835          0   1880.237
{txt}pal_fatali~s {c |}{res}        64        39.5    59.98968          0        277
{txt}{space 5}r_dwage {c |}{res}        64     92.2506    17.34071   72.53587   156.2678
{txt}{hline 13}{c +}{hline 56}
unemployment {c |}{res}        64    .2350504    .0764472   .0991566   .3897921
{txt}
{com}. 
. *right columns
. use "Aid_Rad\2009-2014.dta", clear
{txt}
{com}. collapse $binary $values pal_fatalities $faction_fat $soc_ec ,by(district_year)
{txt}
{com}. sum $binary $values pal_fatalities $faction_fat $soc_ec

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
received_pna {c |}{res}        96    .1261581    .0777298   .0270388   .4119099
{txt}received_c~y {c |}{res}        96    .0408969    .0638944          0    .318822
{txt}received_i~l {c |}{res}        96    .2116971    .2557428          0   .8581499
{txt}received_o~r {c |}{res}        96    .1472887    .1616548          0   .8005114
{txt}{space 9}pna {c |}{res}        91    228.3475    190.2443   22.14517   1150.565
{txt}{hline 13}{c +}{hline 56}
{space 5}charity {c |}{res}        91    31.04639    52.55569          0   331.6291
{txt}internatio~l {c |}{res}        91    193.8281    379.6604          0    2933.62
{txt}{space 7}other {c |}{res}        91    216.8806    332.7642          0   2816.974
{txt}pal_fatali~s {c |}{res}        96    40.30208    117.8934          0        600
{txt}{space 5}r_dwage {c |}{res}        96    90.07501    17.26719   66.73927   150.8451
{txt}{hline 13}{c +}{hline 56}
unemployment {c |}{res}        96     .229657    .0978826    .079084   .4957187
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\akadi\Documents\PhD\Data\Aid_Rad\appendix.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Dec 2022, 12:49:39
{txt}{.-}
{smcl}
{txt}{sf}{ul off}